In [1]:
#Import required libraries
import pandas as pd
import numpy as np
import psycopg2
import sqlalchemy

In [2]:
#load data
df = pd.read_csv("pp-complete.csv")

In [3]:
#explore data
df.info(verbose=True, null_counts=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25744779 entries, 0 to 25744778
Data columns (total 16 columns):
 #   Column                                  Non-Null Count     Dtype
---  ------                                  --------------     -----
 0   {A42E2F04-2538-4A25-94C5-49E29C6C8FA8}  25744779 non-null  object
 1   18500                                   25744779 non-null  int64
 2   1995-01-31 00:00                        25744779 non-null  object
 3   TQ1 1RY                                 25704055 non-null  object
 4   F                                       25744779 non-null  object
 5   N                                       25744779 non-null  object
 6   L                                       25744779 non-null  object
 7   VILLA PARADISO                          25740577 non-null  object
 8   FLAT 10                                 3006208 non-null   object
 9   HIGHER WARBERRY ROAD                    25345665 non-null  object
 10  TORQUAY                                 17227970 non-null  object
 11  TORQUAY.1                               25744779 non-null  object
 12  TORBAY                                  25744779 non-null  object
 13  TORBAY.1                                25744779 non-null  object
 14  A                                       25744779 non-null  object
 15  A.1                                     25744779 non-null  object
dtypes: int64(1), object(15)
memory usage: 3.1+ GB

In [4]:
#explore data
df.head(10)

,{A42E2F04-2538-4A25-94C5-49E29C6C8FA8},18500,1995-01-31 00:00,TQ1 1RY,F,N,L,VILLA PARADISO,FLAT 10,HIGHER WARBERRY ROAD,TORQUAY,TORQUAY.1,TORBAY,TORBAY.1,A,A.1
0,{1BA349E3-2579-40D6-999E-49E2A25D2284},73450,1995-10-09 00:00,L26 7XJ,D,Y,F,6,NaN,CATKIN ROAD,LIVERPOOL,LIVERPOOL,KNOWSLEY,MERSEYSIDE,A,A
1,{E5B50DCB-BC7A-4E54-B167-49E2A6B4148B},59000,1995-03-31 00:00,BH12 2AE,D,N,F,28,NaN,ALDER ROAD,POOLE,POOLE,POOLE,POOLE,A,A
2,{81E50116-D675-4B7F-9F8D-49E2B5D43271},31000,1995-12-04 00:00,IP13 0DR,D,Y,F,NONSUCH COTTAGE,NaN,THE STREET,HACHESTON,WOODBRIDGE,SUFFOLK COASTAL,SUFFOLK,A,A
3,{B97455B9-75CB-40BB-A615-42C53683E143},95000,1995-09-22 00:00,WS14 0BE,D,N,F,FOX COVER COTTAGE,NaN,HALL LANE,LICHFIELD,LICHFIELD,LICHFIELD,STAFFORDSHIRE,A,A
4,{F0D1E8DA-C00D-467A-A41C-42C5378DB6E0},45450,1995-02-28 00:00,S42 5GA,S,Y,F,109,NaN,ELVASTON ROAD,NORTH WINGFIELD,CHESTERFIELD,NORTH EAST DERBYSHIRE,DERBYSHIRE,A,A
5,{7DAC48DA-D479-4922-86B0-42C5580DFC67},96000,1995-10-27 00:00,KT17 2DU,S,N,F,82,NaN,KINGSTON ROAD,EPSOM,EPSOM,EPSOM AND EWELL,SURREY,A,A
6,{10E5F080-7AF3-4982-AAEF-42C55DC955FC},30000,1995-11-28 00:00,WS10 9LD,S,N,F,66,NaN,HILL STREET,WEDNESBURY,WEDNESBURY,WALSALL,WEST MIDLANDS,A,A
7,{B365B080-3670-4955-80F8-42C55F081143},425000,1995-03-31 00:00,KT11 1HP,D,N,F,18,NaN,BRUNSWICK GROVE,COBHAM,COBHAM,ELMBRIDGE,SURREY,A,A
8,{7648EFE5-67A0-4728-B5DE-42C565DA1D28},89995,1995-06-30 00:00,WF6 2TT,D,Y,F,8,NaN,SHAW AVENUE,NORMANTON,NORMANTON,WAKEFIELD,WEST YORKSHIRE,A,A
9,{D30EEA6F-CFB6-489A-9D03-4652DB154C43},40000,1995-10-27 00:00,NR17 1EY,S,N,F,17,NaN,WESTFIELDS,ATTLEBOROUGH,ATTLEBOROUGH,BRECKLAND,NORFOLK,A,A

In [5]:
#explore data
df.describe(include='all')

,{A42E2F04-2538-4A25-94C5-49E29C6C8FA8},18500,1995-01-31 00:00,TQ1 1RY,F,N,L,VILLA PARADISO,FLAT 10,HIGHER WARBERRY ROAD,TORQUAY,TORQUAY.1,TORBAY,TORBAY.1,A,A.1
count,25744779,2.574478e+07,25744779,25704055,25744779,25744779,25744779,25740577,3006208,25345665,17227970,25744779,25744779,25744779,25744779,25744779
unique,25744779,NaN,9477,1268002,5,2,3,497592,56734,318573,23648,1171,461,128,2,1
top,{582D0637-3ED4-8F22-E053-6C04A8C01BAC},NaN,2016-03-31 00:00,YO10 3FT,T,N,F,1,FLAT 2,HIGH STREET,LONDON,LONDON,BIRMINGHAM,GREATER LONDON,A,A
freq,1,NaN,32376,529,7783210,23047320,19665095,641019,162807,165340,900325,1993644,380146,3341238,24874715,25744779
mean,NaN,2.013365e+05,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
std,NaN,8.028588e+05,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
min,NaN,1.000000e+00,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25%,NaN,8.000000e+04,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
50%,NaN,1.400000e+05,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
75%,NaN,2.300000e+05,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
max,NaN,5.943000e+08,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [6]:
#Check the unique values for
np.unique(df[['F','N','L']].values)

array(['D', 'F', 'L', 'N', 'O', 'S', 'T', 'U', 'Y'], dtype=object)

In [7]:
#Check column F
np.unique(df[['F']].values)

array(['D', 'F', 'O', 'S', 'T'], dtype=object)

Column 18500 represents the Price observations, 1995-01-31 00:00 represents the Transfer_Date, TQ1 1RY represents the postcode, F the type and TORQUAY the town. Therefore, I create a list and pass it through the pd-read_csv method to reload the dataframe with the corresponding column headers.

In [8]:
#Add column headers to the dataframe and reload dataframe
col_names=["dropNsequence", "price", "transfer_date", "postcode", "type", "dropn", "dropl","dropvillaparadiso","dropflat",
          "dropstreet","town1","town2","town3","town4","dropa","dropa1"]
df= pd.read_csv("pp-complete.csv",names=col_names)

In [9]:
#Get a summary of missing values
df.isna().sum()

dropNsequence               0
price                       0
transfer_date               0
postcode                40724
type                        0
dropn                       0
dropl                       0
dropvillaparadiso        4202
dropflat             22738571
dropstreet             399114
town1                 8516809
town2                       0
town3                       0
town4                       0
dropa                       0
dropa1                      0
dtype: int64

In [10]:
#count all unique values in each column
df.nunique()

dropNsequence        25744780
price                  212690
transfer_date            9477
postcode              1268002
type                        5
dropn                       2
dropl                       3
dropvillaparadiso      497592
dropflat                56734
dropstreet             318573
town1                   23648
town2                    1171
town3                     461
town4                     128
dropa                       2
dropa1                      1
dtype: int64

4 columns i.e. town1, town2, town3 and town4 recorded the geolocation observation. Since town1 contains most unqiue observations and town2, town3, town4 contain no Null values, the decision was made to keep all four columns in case of exploratory data analysis later on.

In [11]:
#Dropping columns that are not of interest
df1=df.drop(columns=["dropNsequence", "dropn", "dropl","dropvillaparadiso","dropflat",
          "dropstreet","dropa","dropa1"])

In [12]:
#Replace empty cells with NaN
df1 = df1.replace(r'^\s*$', np.nan, regex=True)

In [13]:
#Check for Null values
df1.isna().sum()

price                  0
transfer_date          0
postcode           40724
type                   0
town1            8516809
town2                  0
town3                  0
town4                  0
dtype: int64

In [14]:
#Drop Null values in postcode column and save dataframe in new variable
df2 = df1.dropna(subset=['postcode'])

In [15]:
df2.describe(include = 'all')

,price,transfer_date,postcode,type,town1,town2,town3,town4
count,2.570406e+07,25704056,25704056,25704056,17204331,25704056,25704056,25704056
unique,NaN,9477,1268002,5,23565,1171,461,128
top,NaN,2016-03-31 00:00,YO10 3FT,T,LONDON,LONDON,BIRMINGHAM,GREATER LONDON
freq,NaN,32307,529,7780606,899341,1989110,379766,3335454
mean,2.007501e+05,NaN,NaN,NaN,NaN,NaN,NaN,NaN
std,7.835183e+05,NaN,NaN,NaN,NaN,NaN,NaN,NaN
min,1.000000e+00,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25%,8.000000e+04,NaN,NaN,NaN,NaN,NaN,NaN,NaN
50%,1.400000e+05,NaN,NaN,NaN,NaN,NaN,NaN,NaN
75%,2.300000e+05,NaN,NaN,NaN,NaN,NaN,NaN,NaN
max,5.943000e+08,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [16]:
#Transform string values in transfer_date to datetime values
df2['transfer_date'] = pd.to_datetime(df2['transfer_date'])

/Users/maximilianrekuts/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [17]:
df2.head(5)

,price,transfer_date,postcode,type,town1,town2,town3,town4
0,18500,1995-01-31,TQ1 1RY,F,TORQUAY,TORQUAY,TORBAY,TORBAY
1,73450,1995-10-09,L26 7XJ,D,LIVERPOOL,LIVERPOOL,KNOWSLEY,MERSEYSIDE
2,59000,1995-03-31,BH12 2AE,D,POOLE,POOLE,POOLE,POOLE
3,31000,1995-12-04,IP13 0DR,D,HACHESTON,WOODBRIDGE,SUFFOLK COASTAL,SUFFOLK
4,95000,1995-09-22,WS14 0BE,D,LICHFIELD,LICHFIELD,LICHFIELD,STAFFORDSHIRE

In [18]:
#create a copy
df3 = df2.copy()

In [19]:
#Replace values in type column D -> DETACHED, S -> SEMI_DETACHED, T -> TERRACED, F -> FLATS, O -> OTHER
df3['type'] = df3['type'].replace(['D','S','T','F','O'],['detached','semi_detached','terraced','flats','other'])

In [20]:
#Check if transformation worked
np.unique(df3[['type']].values)

array(['detached', 'flats', 'other', 'semi_detached', 'terraced'],
      dtype=object)

In [ ]:
#save new dataframe as .csv
df3.to_csv('casestudy.csv', index = False, header=True)

In [21]:
df3.info(verbose=True, null_counts=True)

<class 'pandas.core.frame.DataFrame'>
Int64Index: 25704056 entries, 0 to 25744779
Data columns (total 8 columns):
 #   Column         Non-Null Count     Dtype
---  ------         --------------     -----
 0   price          25704056 non-null  int64
 1   transfer_date  25704056 non-null  datetime64[ns]
 2   postcode       25704056 non-null  object
 3   type           25704056 non-null  object
 4   town1          17204331 non-null  object
 5   town2          25704056 non-null  object
 6   town3          25704056 non-null  object
 7   town4          25704056 non-null  object
dtypes: datetime64[ns](1), int64(1), object(6)
memory usage: 1.7+ GB

My machine was not able to upload the new dataframe comprising of 1.7 GB into the database in one go. Thus, I decided to split the dataframe into 20 smaller dataframes. Afterwards, I created a loop so that the 20 dataframes can be incrementally uploaded (divide and conquer).

In [10]:
#split dataframe into 20 smaller dataframes
dfsplit = np.array_split(df3, 20)

In [2]:
#setting up the engine and the api connection respectively with the database
from sqlalchemy import create_engine
engine = create_engine('postgresql://postgres:hKpa2754@localhost:5433/casestudyy')

In [88]:
#creating a loop that iterates 20 times and incrementally appends each dataframe to the database
for upload in range(20):
        dfsplit[upload].to_sql(name = 'casestudy',
           con = engine,
           index = False,
           if_exists='append'
                            )

In [22]:
#load sql module
%load_ext sql

In [23]:
#connect to database
%sql postgresql://postgres:hKpa2754@localhost:5433/casestudyy

After uploading the pre-processed data into the db and loading the sql module, the case study's reports can be created using sql.
Report 1 follows below (I limited the output to 10):

In [25]:
%%sql 
SELECT 
LEFT(postcode, POSITION(' ' IN postcode)) as postcode,
TO_CHAR(transfer_date, 'YYYY-MM') as date,
type,
avg(price)::int as price
FROM casestudy
WHERE LEFT(postcode, POSITION(' ' IN postcode)) <> ''
GROUP BY 1,2,3
ORDER BY postcode, type, date DESC
LIMIT 10;

 * postgresql://postgres:***@localhost:5433/casestudyy
10 rows affected.

[('AL1 ', '2020-11', 'detached', 865000),
 ('AL1 ', '2020-10', 'detached', 1177193),
 ('AL1 ', '2020-09', 'detached', 1328500),
 ('AL1 ', '2020-08', 'detached', 1240167),
 ('AL1 ', '2020-07', 'detached', 798900),
 ('AL1 ', '2020-06', 'detached', 1250000),
 ('AL1 ', '2020-05', 'detached', 766375),
 ('AL1 ', '2020-04', 'detached', 871667),
 ('AL1 ', '2020-03', 'detached', 1200000),
 ('AL1 ', '2020-02', 'detached', 1420000)]

Report 2 (the decision was made to use a similar price brackets as outlined in the case study due to the report's objective. If the report would want to show the entire distribution of prices paid across the UK, creating price brackets based on the interquartile ranges (IQR) would have been more useful to visualise the spread of data points. Again, I limited the output to 10)

In [26]:
%%sql 
WITH prices AS
(SELECT  LEFT(postcode, POSITION(' ' IN postcode)) as postcode,
             TO_CHAR(transfer_date, 'YYYY-MM') as date,
             price,
             case when price <100000 then 'Under 100K'
             when price between 100001 and 250000 then '100K - 250K'
             when price between 250001 and 400000 then '250K - 400K'
             when price between 400001 and 550000 then '400K - 550K'
             when price between 550001 and 700000 then '550K - 700K'
             when price between 700001 and 850000 then '700K - 850K'
             when price between 850001 and 1000000 then '850K - 1m'
             when price  >1000000 then 'Over 1m'
             end as price_brackets
             from casestudy
             GROUP BY 1,2,3,4
             )
SELECT 
date,
postcode,
price_brackets,
count(prices)
from prices
WHERE LEFT(postcode, POSITION(' ' IN postcode)) <> '' AND price_brackets <> ''
GROUP BY 1,2,3
ORDER BY 1
LIMIT 10;

 * postgresql://postgres:***@localhost:5433/casestudyy
10 rows affected.

[('1995-01', 'AL1 ', 'Under 100K', 29),
 ('1995-01', 'AL1 ', '100K - 250K', 5),
 ('1995-01', 'AL1 ', '250K - 400K', 1),
 ('1995-01', 'AL10 ', 'Under 100K', 22),
 ('1995-01', 'AL2 ', 'Under 100K', 15),
 ('1995-01', 'AL2 ', '100K - 250K', 5),
 ('1995-01', 'AL3 ', 'Under 100K', 17),
 ('1995-01', 'AL3 ', '100K - 250K', 5),
 ('1995-01', 'AL3 ', '250K - 400K', 1),
 ('1995-01', 'AL4 ', 'Under 100K', 11)]